# Лабораторная работа 2 - Указатели, арифметика указателей
## Задание 1
**Постановка задачи:** Внутри функции int main(void) { /*...*/ } определите указатель double ***pointer = NULL;. Инициализируйте этот указатель адресом другого указателя типа double **, который указывает на переменную double *, которая указывает на double. Используйте pointer для записи и чтения значения 2.0 в сегмент оперативной памяти для double.

**Список идентификаторов:**
**Имя переменной**|**Тип данных**|**Смысл**
-|-|-
pointer|double***|Укзатель на множетсво других указателей

**Код программы:**
```c
#include <stdio.h>
#include <stdlib.h>


int main(void)
{
	double*** pointer = NULL;
	
	/*По очереди разыменовываем указатели, выделяя
	память под другие указатели*/
	
	*(*(*(pointer = malloc(sizeof(double**)))
	= malloc(sizeof(double*)))
	= malloc(sizeof(double))) = 0.2;
	printf("%lf\n", ***pointer);
	
	/*Высвобождаем выделенную память*/
	
	free(**pointer);
	free(*pointer);
	free(pointer);
	
	return 0;
}
```

**Результат:**
``0.200000``
___
## Задание 2
**Постановка задачи:** Напишите программу, которая складывает два числа с использованием указателей на эти числа.
**Список идентификаторов:**
**Имя переменной**|**Тип данных**|**Смысл**
-|-|-
f|int|Первая переменная
s|int|Вторая переменная
fp|int*|Указатель на первую переменную
sp|int*|Указатель на вторую переменную
sum|int|Сумма чисел

**Код программы:**
```c
#include <stdio.h>
#include <stdlib.h>


int main(void)
{
	int f;
	int s;
	int sum;

	int* fp = &f;
	int* sp = &s;

	printf("First number:  ");
	scanf("%d", fp);
	printf("Second number:  ");
	scanf("%d", sp);

	sum = *fp + *sp;
	printf("Result: %d + %d = %d", *fp, *sp, sum);

	return 0;
}
```
**Результат:**
```
First number:  13
Second number:  342
Result: 13 + 342 = 355
```
___
## Задание 3
**Постановка задачи:** Напишите программу, которая находит максимальное число из двух чисел, используя указатели на эти числа.
**Список идентификаторов:**
**Имя переменной**|**Тип данных**|**Смысл**
-|-|-
f|int|Первая переменная
s|int|Вторая переменная
fp|int*|Указатель на первую переменную
sp|int*|Указатель на вторую переменную
max|int|Максимальное значение среди двух чисел

**Код программы:**
```c
#include <stdio.h>
#include <stdlib.h>


int main(void)
{
	int f;
	int s;
	int max;

	int* fp = &f;
	int* sp = &s;

	printf("First number:  ");
	scanf("%d", fp);
	printf("Second number:  ");
	scanf("%d", sp);

	max = *fp > *sp ? *fp : *sp;
	printf("Max number:  %d", max);

	return 0;
}
```
**Результат:**
```
C:\...>a
First number:  123
Second number:  1234
Max number:  1234
C:\...>a
First number:  32
Second number:  1
Max number:  32
C:\...>a
First number:  123
Second number:  123
Max number:  123
```
___
## Задание 4
**Постановка задачи:** Напишите программу, которая создаёт одномерный динамический массив из чисел с плавающей точкой двойной точности, заполняет его значениями с клавиатуры и распечатывает все элементы этого массива, используя арифметику указателей (оператор +), а не оператор доступа к элементу массива [].
**Список идентификаторов:**
**Имя переменной**|**Тип данных**|**Смысл**
-|-|-
size|int|Размер массива
i|int|Параметр цикла
arr|double*|Динамический массив

**Код программы:**
```c
#include <stdio.h>
#include <stdlib.h>


int main(void)
{
    int size, i;
    double* arr;
    
    printf("Size: ");
    scanf("%d", &size);
    
    arr = calloc(size, sizeof(double));
    
    printf("Enter elements:\n");
    for (i = 0; i < size; i++) { scanf("%lf", &arr[i]); }
    for (i = 0; i < size; i++) { printf("%lf ", *(arr + i)); }
    
    free(arr);
    
    return 0;
}
```
**Результат:**
```
Size: 6
Enter elements:
1.2
34.512
41.124
8
51.15
5112
1.200000 34.512000 41.124000 8.000000 51.150000 5112.000000 
```
___
## Задание 5
**Постановка задачи:** Выведите элементы динамического массива целых чисел в обратном порядке, используя указатель и операцию декремента.
**Список идентификаторов:**
**Имя переменной**|**Тип данных**|**Смысл**
-|-|-
size|int|Размер массива
i|int|Параметр цикла
arr|int*|Динамический массив
arrb|int*|Указатель на начало массива
arre|int*|Указатель на конец массива

**Код программы:**
```c
#include <stdlib.h>
#include <stdio.h>


int main(void)
{
    int size, i;
    int* arr = NULL;
    int *arrb = NULL;
    int *arre = NULL;
    
    printf("Enter size: ");
    scanf("%d", &size);
    
    arr = calloc(size, sizeof(int));
    arrb = &arr[0];
    
    printf("Enter numbers:\n");
    for (i = 0; i < size; ++i) { scanf("%d", &arr[i]); }
    for (arre = &arr[size - 1]; arre != arrb - 1; --arre) { printf("%d\t", *arre); }
    
    free(arr);
    
    return 0;
}
```
**Результат:**
```
Enter size: 5
Enter numbers:
1
3
5
7
9
9	7	5	3	1	
```
___
## Задание 6
**Постановка задачи:** Определите переменную целого типа int a = 1234567890; и выведите побайтово её содержимое на экран, используя указатель char *.
**Список идентификаторов:**
**Имя переменной**|**Тип данных**|**Смысл**
-|-|-
a|int|Переменная целого типа int
i|int|Параметр цикла
ap|char*|Указатель на переменную a

**Код программы:**
```c
#include <stdlib.h>
#include <stdio.h>


int main(void)
{
    int i;
    int a = 1234567890;
    char* ap = (char*)&a;
    
    for (i = 0; i < sizeof(a); ++i) { printf("%d", (int)*(ap + i)); }
    
    return 0;
}
```
**Результат:**
``-462-10673``
___
## Задание 7
**Постановка задачи:** Выделите память под двумерный динамический массив, используя массив указателей на строки (см. лекции), и затем корректно освободите оперативную память.
**Список идентификаторов:**
**Имя переменной**|**Тип данных**|**Смысл**
-|-|-
a|char****|Двумерный динамический массив указателей на строки
i|int|Параметр цикла i
j|int|Параметр цикла j
rows|int|Количество радов
cols|int|Количество столбцов
**Код программы:**

```c
#include <stdlib.h>
#include <stdio.h>


int main(void)
{
    int rows, cols, i, j;
    char**** a = NULL;
    rows = 5;
    cols = 3;
    a = calloc(rows, sizeof(char***));
    
    for (i = 0; i < rows; ++i) { a[i] = calloc(cols, sizeof(char**)); }
    
    for (i = 0; i < rows; ++i)
    { for (j = 0; j < cols; ++j) { a[i][j] = malloc(sizeof(char*)); } }
    
    for (i = 0; i < rows; ++i)
    { for (j = 0; j < cols; ++j) { *a[i][j] = "opop"; } }
    
    for (i = 0; i < rows; ++i)
    { for (j = 0; j < cols; ++j) { printf("%s\t", *a[i][j]); } printf("\n"); }
    
    for (i = 0; i < rows; ++i)
    { for (j = 0; j < cols; ++j) { free(a[i][j]); } }
    
    for (i = 0; i < rows; ++i) { free(a[i]); }
    free(a);
    
    return 0;
}
```
**Результат:**
```
opop	opop	opop	
opop	opop	opop	
opop	opop	opop	
opop	opop	opop	
opop	opop	opop
```
___
#### Выполнил студент первого курса группы 1об_ИВТ-2 Пименов Егор