# Самостоятельная работа 1
## Задание 1
**Постановка задачи:** Внутри функции int main(void) { /*...*/ } определите указатель double ***pointer = NULL;. Инициализируйте этот указатель адресом другого указателя типа double **, который указывает на переменную double *, которая указывает на double. Используйте pointer для записи и чтения значения 2.0 в сегмент оперативной памяти для double.

**Список идентификаторов:**
**Имя переменной**|**Тип данных**|**Смысл**
-|-|-
N|unsigned int|Размер динамического массива
i|unsigned int|Параметр цикла
arr|float*|Динамический массив чисел с плавающей точкой
sum|float|Сумма элементов динамического массива

**Код программы:**
```c
#include <stdio.h>
#include <stdlib.h>


int main(void)
{
    unsigned int N, i;
    float sum;
    float* arr = NULL;
    
    printf("Enter size: ");
    scanf("%d", &N);
    
    arr = calloc(N, sizeof(float));
    sum = 0;
    
    printf("Enter numbers:\n");
    for (i = 0; i < N; ++i) { scanf("%f", &arr[i]); }
    for (i = 0; i < N; ++i) { sum += *(arr + i); }
    
    printf("Mean: %.2f", sum / N);
    
    free(arr);
    
    return 0;
}
```

**Результат:**
```
Enter size: 6
Enter numbers:
1
2
3
5
1
8
Mean: 3.33
```
___
## Задание 2
**Постановка задачи:**
Создайте структуру Book, которая содержит следующие поля:
- title – массив символов (строка) для хранения названия книги (максимум 50 символов);
- author – массив символов для хранения имени автора (максимум 50 символов);
- year – целое число, обозначающее год издания книги.

Напишите программу, которая:
- Создаёт массив из 3-х экземпляров структуры Book.
- Запрашивает у пользователя данные для каждой книги (название, автора и год издания).
- Выводит информацию обо всех книгах на экран, используя для этого отдельную функцию printBook(), которая принимает указатель на структуру Book.

**Список идентификаторов:**
**Имя переменной**|**Тип данных**|**Смысл**
-|-|-
size|unsigned  int|Размер массива
i|unsigned  int|Параметр цикла
arr|Book[]|Массив экземпляров структуры Book

**Код программы:**
```c
#include <stdio.h>
#include <stdlib.h>


struct Book
{
    char title[50];
    char author[50];
    unsigned int year;
};


void printBook(struct Book*);


int main(void)
{
    unsigned int size = 3;
    unsigned int i;
    struct Book arr[size];
    
    for (i = 0; i < size; ++i)
    {
        printf("Info about book №%d:\n", i + 1);
        printf("Enter title: ");
        if (i > 0) { while((getchar()) != '\n'); }
        fgets(arr[i].title, 50, stdin);
        printf("Enter author: ");
        fgets(arr[i].author, 50, stdin);
        printf("Enter year: ");
        scanf("%u", &arr[i].year);
        printf("\n");
    }
    
    for (i = 0; i < size; ++i) { printBook(&arr[i]); }
    
    return 0;
}


void printBook(struct Book* book)
{
    printf("Book info: \n");
    printf("Title: %s", book->title);
    printf("Author: %s", book->author);
    printf("year: %u\n\n", book->year);
}
```
**Результат:**
```
Info about book №1:
Enter title: Popuk
Enter author: Egor P.
Enter year: 2026

Info about book №2:
Enter title: Popuk: New beginnings
Enter author: Egor P.
Enter year: 2034

Info about book №3:
Enter title: Popuk: Final Chapter
Enter author: Egor P.
Enter year: 2049

Book info: 
Title: Popuk
Author: Egor P.
year: 2026

Book info: 
Title: Popuk: New beginnings
Author: Egor P.
year: 2034

Book info: 
Title: Popuk: Final Chapter
Author: Egor P.
year: 2049
```
___
## Задание 3
**Постановка задачи:** 
Создайте перечисление Season со следующими значениями:
- WINTER, SPRING, SUMMER, AUTUMN

Напишите программу, которая: 
- Запрашивает у пользователя номер месяца (целое число от 1 до 12).
- На основе введённого номера месяца определяет и выводит соответствующий сезон:
	- Зима: декабрь (12), январь (1) и февраль (2);
	- Весна: март (3), апрель (4) и май (5);
	- Лето: июнь (6), июль (7) и август (8);
	- Осень: сентябрь (9), октябрь (10) и ноябрь (11).
- Для определения сезона можно использовать условные операторы (if-else) или конструкцию switch.

**Список идентификаторов:**
**Имя переменной**|**Тип данных**|**Смысл**
-|-|-
season|enum Season|Экземпляр пересечения Season
month|unsigned short|Вводимый номер месяца

**Код программы:**
```c
#include <stdio.h>
#include <stdlib.h>


enum Season
{
    WINTER,
    SPRING,
    SUMMER,
    AUTUMN
};


int main(void)
{
    enum Season season;
    unsigned short month;
    
    printf("Enter month (1-12): ");
    scanf("%u", &month);
    
    if (month == 12 || month == 1 || month == 2) { season = WINTER; }
    else if (month == 3 || month == 4 || month == 5) { season = SPRING; }
    else if (month == 6|| month == 7 || month == 8) { season = SUMMER; }
    else if (month == 9 || month == 10 || month == 11) { season = AUTUMN; }
    
    switch (season)
    {
        case WINTER: printf("Season: Winter"); break;
        case SPRING: printf("Season: Spring"); break;
        case SUMMER: printf("Season: Summer"); break;
        case AUTUMN: printf("Season: Autumn"); break;
    }
    
    return 0;
}
```
**Результат:**
```
C:\...>a
Enter month (1-12): 6
Season: Summer
C:\...>a
Enter month (1-12): 1
Season: Winter
C:\...>a
Enter month (1-12): 9
Season: Autumn
C:\...>a
Enter month (1-12): 4
Season: Spring
```
___
#### Выполнил студент первого курса группы 1об_ИВТ-2 Пименов Егор